//Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт максимальное число

/*
Console.Write("Видите первое число: ");
int firstNumber = Convert.ToInt32(Console.ReadLine());

Console.Write("Видите второе число: ");
int seondNumbers = Convert.ToInt32(Console.ReadLine());

if (firstNumber > seondNumbers)
{
    Console.WriteLine(firstNumber);
}

else
{
    Console.WriteLine(seondNumbers);
}
*/

//Задача 4: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.

/*
Console.Write("Видите первое число: ");
int firstNumber = Convert.ToInt32(Console.ReadLine());

Console.Write("Видите второе число: ");
int seondNumbers = Convert.ToInt32(Console.ReadLine());

Console.Write("Видите третее число: ");
int thirdNumbers = Convert.ToInt32(Console.ReadLine());

int maxNamber = firstNumber;


if (firstNumber > maxNamber) maxNamber = firstNumber;
if (seondNumbers > maxNamber) maxNamber = seondNumbers;
if (thirdNumbers > maxNamber) maxNamber = thirdNumbers;
      Console.WriteLine(maxNamber);

*/

